# Global VS Code extensions
# One extension ID per line — publisher.extension-name format
# Lines starting with # are comments and are ignored by deploy.sh
# See extensions.md for descriptions and documentation links

akamud.vscode-theme-onedark
christian-kohler.path-intellisense
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
github.vscode-pull-request-github
kevinrose.vsc-python-indent
matangover.mypy
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
njpwerner.autodocstring
pkief.material-icon-theme
yzane.markdown-pdf
